---
kind: property
id: P:Autodesk.Revit.DB.FamilyThermalProperties.AnalyticConstructionTypeId
source: html/d2b7f8c5-b644-2ab8-d168-b60e97513beb.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties.AnalyticConstructionTypeId Property

The construction gbXML type.
 This value corresponds to the 'id' property of a constructionType node in Constructions.xml.

## Syntax (C#)
```csharp
public string AnalyticConstructionTypeId { get; }
```